alibaba/AliOS-Things/hardware/chip/rtl872xd/sdk/component/soc/realtek/amebad/fwlib/include/rtl8721d_flash.h
/**
  ******************************************************************************
  * @file    rtl8721d_flash.h
  * @author
  * @version V1.0.0
  * @date    2016-05-17
  * @brief   This file contains all the functions prototypes for the Flash firmware
  *          library.
  ******************************************************************************
  * @attention
  *
  * This module is a confidential and proprietary property of RealTek and
  * possession or use of this module requires written permission of RealTek.
  *
  * Copyright(c) 2016, Realtek Semiconductor Corporation. All rights reserved.
  ****************************************************************************** 
  */

#ifndef _RTL8710B_SPI_FLASH_H
#define _RTL8710B_SPI_FLASH_H

#include "rtl8721d_flashclk.h"

/** @addtogroup AmebaD_Periph_Driver
  * @{
  */

/** @defgroup FLASH 
  * @brief SPI Flash driver modules
  * @{
  */

/** @addtogroup FLASH
  * @verbatim
  *****************************************************************************************
  * Introduction
  *****************************************************************************************
  * SPI_Flash_Controller is used to communicate with SPI_Flash.
  * Support auto mode and user mode to access Flash.
  * Support multi-channel(1/2/4)data bit to transmit/receive.
  * Programmable feature:
  *		SPI channel number - Control channel bits of serial transfer.
  *		SPI Clock rate - Control the bit rate of serial transfer.
  *		Flash command registers - Flexible to set the different command codes for 
  *			different flash vendors in automatic mode.
  *		Dummy cycles- Allow users to add dummy cycles in receiving data path for 
  *			timing tuning or extra pipelining registers.
  *		Flash address size- Define the size of Flash to enable the slave select output 
  *			in automatic mode.
  *
  *****************************************************************************************
  * How to use SPI_Flash_Controller to Read/Program/Erase flash
  *****************************************************************************************
  * To use the SPI_Flash_Controller to Read/Program/Erase flash, you can follow the steps
  * below:
  *       
  *   1. Enable SPIC clock by using RCC_PeriphClockCmd(APBPeriph_FLASH, APBPeriph_FLASH_CLOCK_XTAL, ENABLE) function.
  *
  *   2. Call Pinmux_SpicCtrl(PinLocation, ON) to configure SPIC pinmux.
  *
  *   3. Fill the variable flash_init_para of type FLASH_InitTypeDef with default parameters 
  *      using one of the following functions according to flash vendor:
  *               flash vendor            Struct Init Function
  *               Winbond                 FLASH_StructInit(&flash_init_para)         
  *               Gigadevice              FLASH_StructInit_GD(&flash_init_para)
  *               Micron                  FLASH_StructInit_Micron(&flash_init_para)
  *               MXIC                    FLASH_StructInit_MXIC(&flash_init_para)
  *
  *         Note: (1)We support 4 flash chip vendors above in SDK.  
  *               (2)If the flash chip type is Gigadevic and flash size is more than 2MB, 
  *               you must set the FLASH_cmd_wr_status2 parameter in flash_init_para 
  *               according to spec, because the Write Status Register1 command is
  *               different from write Status Register2 command.
  *               (3)If it is Micron flash chip, it is mandatory to set dummy cycles to 
  *               Nonvolatile Configuration Register of flash. The number of dummy cycles is
  *               determined by Clock Frequency and Bit Mode according to spec.
  *               (4)If the flash chip type is Micron N25q00aa, you must set FLASH_cmd_chip_e
  *               parameter according to spec because it is different from default setting.
  *
  *   4. Initialize SPIC to designated BitMode using FLASH_Init().
  * 
  *   5. Enable Quad I/O by setting QuadEnable bit in FLASH status register.
  *   
  *   6. Switch SPIC to higher clock rate using RCC_PeriphClockCmd(APBPeriph_FLASH, APBPeriph_FLASH_CLOCK_PLL, ENABLE) function.
  *
  *   7. Calibrate by calling FLASH_CalibrationNew() function.
  * 
  *   8. Then you can Read/Program/Erase flash by calling corresponding functions.
  *      Remember to add flash_write_lock() function before those operations and 
  *      flash_write_unlock() after them to protect them when FLASH XIP. 
  *
  *       Note: (1)If flash code has some updates when XIP, you need to flush cache by calling
  *             Cache_Flush() function.
  *             (2)When XIP, the flash initialization and calibration have already finished,
  *             you can Read/Program/Erase flash directly without excuting 1~6 steps described
  *             above.
  * @endverbatim
  */

/* Exported types ------------------------------------------------------------*/

/** @defgroup FLASH_Exported_Types FLASH Exported Types
  * @{
  */

/** 
  * @brief  FLASH Init structure definition  
  */
typedef struct {
	u32 FLASH_Id;				/*!< Specifies the flash vendor ID.
								This parameter can be a value of @ref FLASH_VENDOR_ID_definitions */
	u8 FLASH_cur_bitmode;		/*!< Specifies the current bitmode of SPIC.
								This parameter can be a value of @ref FLASH_BIT_Mode_definitions */
	u8 FLASH_baud_rate;			/*!< Specifies the spi_sclk divider value. The frequency of spi_sclk is derived from:
								Frequency of spi_sclk = Frequency of oc_clk / (2 * FLASH_baud_rate) */
	u8 FLASH_baud_boot;			/*!< Specifies the spi_sclk divider value for rom boot. The frequency of spi_sclk is derived from:
								Frequency of spi_sclk = Frequency of oc_clk / (2 * FLASH_baud_rate) */
	u32 FLASH_cur_cmd; 			/*!< Specifies the current read cmd which is used to read data from flash
								in current bitmode. */
						
	/* status bits define */
	u32 FLASH_QuadEn_bit;		/*!< Specifies the QE bit in status register which is used to enable Quad I/O mode . */
	u32 FLASH_Busy_bit;			/*!< Specifies the WIP(Write in Progress) bit in status register which indicates whether 
								the device is busy in program/erase/write status register progress. */
	u32 FLASH_WLE_bit; 			/*!< Specifies the WEL(Write Enable Latch) bit in status register which indicates whether
								the device will accepts program/erase/write status register instructions*/
	u32 FLASH_Status2_exist;		/*!< Specifies whether this flash chip has Status Register2 or not.
								This parameter can be 0/1. 0 means it doesn't have Status Register2, 1 means 
								it has Status Register2.*/
	
	/* calibration data */
	u8 FLASH_rd_sample_phase_cal;	/*!< Specifies the read sample phase obtained from calibration. this is cal sample phase get from high speed cal */
	u8 FLASH_rd_sample_phase;	/*!< Specifies the read sample phase obtained from calibration. this is current sample phase */
	u8 FLASH_rd_dummy_cyle[3];	/*!< Specifies the read dummy cycle of different bitmode according to 
								flash datasheet*/

	/* valid R/W command set */
	u32 FLASH_rd_dual_o; 			/*!< Specifies dual data read cmd */
	u32 FLASH_rd_dual_io; 			/*!< Specifies dual data/addr read cmd */
	u32 FLASH_rd_quad_o; 		/*!< Specifies quad data read cmd */
	u32 FLASH_rd_quad_io; 		/*!< Specifies quad data/addr read cmd */   
	u32 FLASH_wr_dual_i; 			/*!< Specifies dual data write cmd */
	u32 FLASH_wr_dual_ii;			/*!< Specifies dual data/addr write cmd */
	u32 FLASH_wr_quad_i; 			/*!< Specifies quad data write cmd */
	u32 FLASH_wr_quad_ii;			/*!< Specifies quad data/addr write cmd */
	u32 FALSH_dual_valid_cmd;		/*!< Specifies valid cmd of dual bitmode to program/read flash in auto mode */
	u32 FALSH_quad_valid_cmd;	/*!< Specifies valid cmd of quad bitmode to program/read flash in auto mode */

