alibaba/AliOS-Things/hardware/chip/rtl872xd/sdk/component/soc/realtek/amebad/fwlib/include/rtl8721d_flash.h
/** @defgroup FLASH_Exported_XIP_Functions FLASH Exported XIP Functions
  * @note these functions will lock cpu when exec to forbit XIP, and flush cache after exec
  * @{
  */
void FLASH_Write_Lock(void);
void FLASH_Write_Unlock(void);
void FLASH_RxCmdXIP(u8 cmd, u32 read_len, u8* read_data);
void FLASH_SetStatusXIP(u8 Cmd, u32 Len, u8* Status);
void FLASH_SetStatusBitsXIP(u32 SetBits, u32 NewState);
void FLASH_TxData12BXIP(u32 StartAddr, u8 DataPhaseLen, u8* pData);
void FLASH_TxData256BXIP(u32 StartAddr, u32 DataPhaseLen, u8* pData);
void FLASH_EraseXIP(u32 EraseType, u32 Address);
void FLASH_EreaseDwordsXIP(u32 address, u32 dword_num);
void FLASH_Write_IPC_Int(VOID *Data, u32 IrqStatus, u32 ChanNum);
/**
  * @}
  */

/* Registers Definitions --------------------------------------------------------*/
/**************************************************************************//**
 * @defgroup FLASH_Register_Definitions FLASH Register Definitions
 * @{
 *****************************************************************************/
   
/**************************************************************************//**
 * @defgroup SPIC_CTRLR0
 * @{
 *****************************************************************************/
/********************  Bits definition for SPIC_CTRLR0 register  *******************/
#define BIT_CMD_CH(x)				(((x) & 0x00000003) << 20)
#define BIT_DATA_CH(x)			(((x) & 0x00000003) << 18)
#define BIT_ADDR_CH(x)			(((x) & 0x00000003) << 16)
#define BIT_TMOD(x)				(((x) & 0x00000003) << 8)
#define BIT_SCPOL					(0x00000001 << 7)
#define BIT_SCPH					(0x00000001 << 6)
/** @} */

/**************************************************************************//**
 * @defgroup SPIC_CTRLR1
 * @{
 *****************************************************************************/
/********************  Bits definition for SPIC_CTRLR1 register  *******************/
#define BIT_NDF(x)					((x) & 0xffff)
/** @} */

/**************************************************************************//**
 * @defgroup SPIC_SSIENR
 * @{
 *****************************************************************************/
/********************  Bits definition for SPIC_SSIENR register  *******************/
#define BIT_ATCK_CMD				(0x00000001 << 1)
#define BIT_SPIC_EN				(0x00000001)
/** @} */

/**************************************************************************//**
 * @defgroup SPIC_SER
 * @{
 *****************************************************************************/
/********************  Bits definition for SPIC_SER register  *******************/
#define BIT_SER					(0x00000001)
/** @} */

/**************************************************************************//**
 * @defgroup SPIC_BAUDR
 * @{
 *****************************************************************************/
/********************  Bits definition for SPIC_BAUDR register  *******************/
#define BIT_SCKDV(x)				((x) & 0x0fff)
/** @} */

/**************************************************************************//**
 * @defgroup SPIC_SR
 * @{
 *****************************************************************************/
/********************  Bits definition for SPIC_SR register  *******************/
#define BIT_TXE					(0x00000001 << 5)
#define BIT_RFF					(0x00000001 << 4)
#define BIT_RFNE					(0x00000001 << 3)
#define BIT_TFE					(0x00000001 << 2)
#define BIT_TFNF					(0x00000001 << 1)
#define BIT_BUSY					(0x00000001)
/** @} */

/**************************************************************************//**
 * @defgroup SPIC_IMR
 * @{
 *****************************************************************************/
/********************  Bits definition for SPIC_IMR register  *******************/
#define BIT_TXSIM					(0x00000001 << 9)
#define BIT_ACEIM                             	(0x00000001 << 8)
#define BIT_BYEIM                             	(0x00000001 << 7)
#define BIT_WBEIM                             	(0x00000001 << 6)
#define BIT_FSEIM                             	(0x00000001 << 5)
#define BIT_RXFIM                             	(0x00000001 << 4)
#define BIT_RXOIM                             	(0x00000001 << 3)
#define BIT_RXUIM                             	(0x00000001 << 2)
#define BIT_TXOIM                             	(0x00000001 << 1)
#define BIT_TXEIM                             	(0x00000001)
/** @} */

/**************************************************************************//**
 * @defgroup SPIC_ISR
 * @{
 *****************************************************************************/
/********************  Bits definition for SPIC_ISR register  *******************/
#define BIT_TXSIS                             	(0x00000001 << 9)
#define BIT_ACEIS                             	(0x00000001 << 8)
#define BIT_BYEIS                             	(0x00000001 << 7)
#define BIT_WBEIS                             	(0x00000001 << 6)
#define BIT_FSEIS                             	(0x00000001 << 5)
#define BIT_RXFIS                             	(0x00000001 << 4)
#define BIT_RXOIS                             	(0x00000001 << 3)
#define BIT_RXUIS                             	(0x00000001 << 2)
#define BIT_TXOIS                             	(0x00000001 << 1)
#define BIT_TXEIS                             	(0x00000001)
/** @} */

/**************************************************************************//**
 * @defgroup SPIC_RISR
 * @{
 *****************************************************************************/
/********************  Bits definition for SPIC_RISR register  *******************/
#define BIT_ACEIR                             	(0x00000001 << 8)
#define BIT_BYEIR                             	(0x00000001 << 7)
#define BIT_WBEIR                             	(0x00000001 << 6)
#define BIT_FSEIR                             	(0x00000001 << 5)
#define BIT_RXFIR                             	(0x00000001 << 4)
#define BIT_RXOIR                             	(0x00000001 << 3)
#define BIT_RXUIR                             	(0x00000001 << 2)
#define BIT_TXOIR                             	(0x00000001 << 1)
#define BIT_TXEIR                             	(0x00000001)
/** @} */

/**************************************************************************//**
 * @defgroup SPIC_CTRLR2
 * @{
 *****************************************************************************/
/********************  Bits definition for SPIC_CTRLR2 register  *******************/
#define BIT_FIFO_ENTRY(x)			(((x) & 0x0000000f) << 4)
#define BIT_WR_SEQ				(0x00000001 << 3)
#define BIT_WPN_DNUM			(0x00000001 << 2) /* Indicate the WPn input pin of SPI Flash is connected to, 0(default): WP=spi_sout[2], 1:WP=spi_sout[3]. */
#define BIT_WPN_SET				(0x00000001 << 1) /* To implement write protect function. spi_wen_out and the bit of spi_sout which connects to WPN would be initial to 0. */
#define BIT_SO_DUM				(0x00000001) /* SO input pin of SPI Flash, 0: SO connects to spi_sout[0]. 1(default): SO connects to spi_sout[1].*/
/** @} */

/**************************************************************************//**
 * @defgroup SPIC_ADDR_LENGTH
 * @{
 *****************************************************************************/
/********************  Bits definition for SPIC_ADDR_LENGTH register  *******************/
#define BIT_ADDR_PHASE_LENGTH(x)	((x) & 0x00000007)
/** @} */

/**************************************************************************//**
 * @defgroup SPIC_AUTO_LENGTH
 * @{
 *****************************************************************************/
/********************  Bits definition for SPIC_AUTO_LENGTH register  *******************/
#define BIT_CS_H_WR_DUM_LEN(x)	(((x) & 0x0000000f) << 28)
#define BIT_CS_H_RD_DUM_LEN(x)	(((x) & 0x00000003) << 26)
#define BIT_AUTO_DUM_LEN(x)		(((x) & 0x000000ff) << 18)
#define BIT_AUTO_ADDR_LENGTH(x)	(((x) & 0x00000003) << 16)
#define BIT_RD_DUMMY_LENGTH(x)	(((x) & 0x00000fff))
/** @} */

/**************************************************************************//**
 * @defgroup SPIC_VALID_CMD
 * @{
 *****************************************************************************/
/********************  Bits definition for SPIC_VALID_CMD register  *******************/
#define BIT_CTRLR0_CH			(0x00000001 << 12)
#define BIT_PRM_EN				(0x00000001 << 11)
#define BIT_WR_BLOCKING			(0x00000001 << 9)
#define BIT_WR_QUAD_II			(0x00000001 << 8)
#define BIT_WR_QUAD_I			(0x00000001 << 7)
#define BIT_WR_DUAL_II			(0x00000001 << 6)
#define BIT_WR_DUAL_I			(0x00000001 << 5)
#define BIT_RD_QUAD_IO			(0x00000001 << 4)
#define BIT_RD_QUAD_O			(0x00000001 << 3)
#define BIT_RD_DUAL_IO			(0x00000001 << 2)
#define BIT_RD_DUAL_I			(0x00000001 << 1)
#define BIT_FRD_SINGEL			(0x00000001)
#define SPIC_VALID_CMD_MASK		(0x7fff)

#define DUAL_PRM_CYCLE_NUM		4
#define QUAD_PRM_CYCLE_NUM		2
/** @} */

/**
  * @}
  */

/**
  * @}
  */
/**
  * @}
  */

/* Other definations --------------------------------------------------------*/
extern FLASH_InitTypeDef flash_init_para;
extern u32 SPIC_CALIB_PATTERN[2];

typedef void (*FLASH_STRUCT_INIT_FUNC)(FLASH_InitTypeDef* FLASH_InitStruct);

#define SPIC_LOWSPEED_SAMPLE_PHASE	1
#endif  //_RTL8710B_SPI_FLASH_H
/******************* (C) COPYRIGHT 2016 Realtek Semiconductor *****END OF FILE****/
